zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_dbell.h
// Field:    [14] RATCH2
//
// Radio timer channel 2 interrupt flag. Write zero to clear flag. Write to one
// has no effect.
#define RFC_DBELL_RFHWIFG_RATCH2                                    0x00004000
#define RFC_DBELL_RFHWIFG_RATCH2_BITN                                       14
#define RFC_DBELL_RFHWIFG_RATCH2_M                                  0x00004000
#define RFC_DBELL_RFHWIFG_RATCH2_S                                          14

// Field:    [13] RATCH1
//
// Radio timer channel 1 interrupt flag. Write zero to clear flag. Write to one
// has no effect.
#define RFC_DBELL_RFHWIFG_RATCH1                                    0x00002000
#define RFC_DBELL_RFHWIFG_RATCH1_BITN                                       13
#define RFC_DBELL_RFHWIFG_RATCH1_M                                  0x00002000
#define RFC_DBELL_RFHWIFG_RATCH1_S                                          13

// Field:    [12] RATCH0
//
// Radio timer channel 0 interrupt flag. Write zero to clear flag. Write to one
// has no effect.
#define RFC_DBELL_RFHWIFG_RATCH0                                    0x00001000
#define RFC_DBELL_RFHWIFG_RATCH0_BITN                                       12
#define RFC_DBELL_RFHWIFG_RATCH0_M                                  0x00001000
#define RFC_DBELL_RFHWIFG_RATCH0_S                                          12

// Field:    [11] RFESOFT2
//
// RF engine software defined interrupt 2 flag. Write zero to clear flag. Write
// to one has no effect.
#define RFC_DBELL_RFHWIFG_RFESOFT2                                  0x00000800
#define RFC_DBELL_RFHWIFG_RFESOFT2_BITN                                     11
#define RFC_DBELL_RFHWIFG_RFESOFT2_M                                0x00000800
#define RFC_DBELL_RFHWIFG_RFESOFT2_S                                        11

// Field:    [10] RFESOFT1
//
// RF engine software defined interrupt 1 flag. Write zero to clear flag. Write
// to one has no effect.
#define RFC_DBELL_RFHWIFG_RFESOFT1                                  0x00000400
#define RFC_DBELL_RFHWIFG_RFESOFT1_BITN                                     10
#define RFC_DBELL_RFHWIFG_RFESOFT1_M                                0x00000400
#define RFC_DBELL_RFHWIFG_RFESOFT1_S                                        10

// Field:     [9] RFESOFT0
//
// RF engine software defined interrupt 0 flag. Write zero to clear flag. Write
// to one has no effect.
#define RFC_DBELL_RFHWIFG_RFESOFT0                                  0x00000200
#define RFC_DBELL_RFHWIFG_RFESOFT0_BITN                                      9
#define RFC_DBELL_RFHWIFG_RFESOFT0_M                                0x00000200
#define RFC_DBELL_RFHWIFG_RFESOFT0_S                                         9

// Field:     [8] RFEDONE
//
// RF engine command done interrupt flag. Write zero to clear flag. Write to
// one has no effect.
#define RFC_DBELL_RFHWIFG_RFEDONE                                   0x00000100
#define RFC_DBELL_RFHWIFG_RFEDONE_BITN                                       8
#define RFC_DBELL_RFHWIFG_RFEDONE_M                                 0x00000100
#define RFC_DBELL_RFHWIFG_RFEDONE_S                                          8

// Field:     [6] TRCTK
//
// Debug tracer system tick interrupt flag. Write zero to clear flag. Write to
// one has no effect.
#define RFC_DBELL_RFHWIFG_TRCTK                                     0x00000040
#define RFC_DBELL_RFHWIFG_TRCTK_BITN                                         6
#define RFC_DBELL_RFHWIFG_TRCTK_M                                   0x00000040
#define RFC_DBELL_RFHWIFG_TRCTK_S                                            6

// Field:     [5] MDMSOFT
//
// Modem software defined interrupt flag. Write zero to clear flag. Write to
// one has no effect.
#define RFC_DBELL_RFHWIFG_MDMSOFT                                   0x00000020
#define RFC_DBELL_RFHWIFG_MDMSOFT_BITN                                       5
#define RFC_DBELL_RFHWIFG_MDMSOFT_M                                 0x00000020
#define RFC_DBELL_RFHWIFG_MDMSOFT_S                                          5

// Field:     [4] MDMOUT
//
// Modem FIFO output interrupt flag. Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFHWIFG_MDMOUT                                    0x00000010
#define RFC_DBELL_RFHWIFG_MDMOUT_BITN                                        4
#define RFC_DBELL_RFHWIFG_MDMOUT_M                                  0x00000010
#define RFC_DBELL_RFHWIFG_MDMOUT_S                                           4

// Field:     [3] MDMIN
//
// Modem FIFO input interrupt flag. Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFHWIFG_MDMIN                                     0x00000008
#define RFC_DBELL_RFHWIFG_MDMIN_BITN                                         3
#define RFC_DBELL_RFHWIFG_MDMIN_M                                   0x00000008
#define RFC_DBELL_RFHWIFG_MDMIN_S                                            3

// Field:     [2] MDMDONE
//
// Modem command done interrupt flag. Write zero to clear flag. Write to one
// has no effect.
#define RFC_DBELL_RFHWIFG_MDMDONE                                   0x00000004
#define RFC_DBELL_RFHWIFG_MDMDONE_BITN                                       2
#define RFC_DBELL_RFHWIFG_MDMDONE_M                                 0x00000004
#define RFC_DBELL_RFHWIFG_MDMDONE_S                                          2

// Field:     [1] FSCA
//
// Frequency synthesizer calibration accelerator interrupt flag. Write zero to
// clear flag. Write to one has no effect.
#define RFC_DBELL_RFHWIFG_FSCA                                      0x00000002
#define RFC_DBELL_RFHWIFG_FSCA_BITN                                          1
#define RFC_DBELL_RFHWIFG_FSCA_M                                    0x00000002
#define RFC_DBELL_RFHWIFG_FSCA_S                                             1

//*****************************************************************************
//
// Register: RFC_DBELL_O_RFHWIEN
//
//*****************************************************************************
// Field:    [19] RATCH7
//
// Interrupt enable for RFHWIFG.RATCH7.
#define RFC_DBELL_RFHWIEN_RATCH7                                    0x00080000
#define RFC_DBELL_RFHWIEN_RATCH7_BITN                                       19
#define RFC_DBELL_RFHWIEN_RATCH7_M                                  0x00080000
#define RFC_DBELL_RFHWIEN_RATCH7_S                                          19

// Field:    [18] RATCH6
//
// Interrupt enable for RFHWIFG.RATCH6.
#define RFC_DBELL_RFHWIEN_RATCH6                                    0x00040000
#define RFC_DBELL_RFHWIEN_RATCH6_BITN                                       18
#define RFC_DBELL_RFHWIEN_RATCH6_M                                  0x00040000
#define RFC_DBELL_RFHWIEN_RATCH6_S                                          18

// Field:    [17] RATCH5
//
// Interrupt enable for RFHWIFG.RATCH5.
#define RFC_DBELL_RFHWIEN_RATCH5                                    0x00020000
#define RFC_DBELL_RFHWIEN_RATCH5_BITN                                       17
#define RFC_DBELL_RFHWIEN_RATCH5_M                                  0x00020000
#define RFC_DBELL_RFHWIEN_RATCH5_S                                          17

// Field:    [16] RATCH4
//
// Interrupt enable for RFHWIFG.RATCH4.
#define RFC_DBELL_RFHWIEN_RATCH4                                    0x00010000
#define RFC_DBELL_RFHWIEN_RATCH4_BITN                                       16
#define RFC_DBELL_RFHWIEN_RATCH4_M                                  0x00010000
#define RFC_DBELL_RFHWIEN_RATCH4_S                                          16

// Field:    [15] RATCH3
//
// Interrupt enable for RFHWIFG.RATCH3.
#define RFC_DBELL_RFHWIEN_RATCH3                                    0x00008000
#define RFC_DBELL_RFHWIEN_RATCH3_BITN                                       15
#define RFC_DBELL_RFHWIEN_RATCH3_M                                  0x00008000
#define RFC_DBELL_RFHWIEN_RATCH3_S                                          15

